MikroElektronika/core_packages/PIC/XC8/def/PIC18F6680/mcu.h
// Register: RXB0EIDL
#define RXB0EIDL RXB0EIDL
extern volatile unsigned char           RXB0EIDL            __at(0xF64);
#ifndef _LIB_BUILD
asm("RXB0EIDL equ 0F64h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID0                   :1;
        unsigned EID1                   :1;
        unsigned EID2                   :1;
        unsigned EID3                   :1;
        unsigned EID4                   :1;
        unsigned EID5                   :1;
        unsigned EID6                   :1;
        unsigned EID7                   :1;
    };
    struct {
        unsigned RXB0EID0               :1;
        unsigned RXB0EID1               :1;
        unsigned RXB0EID2               :1;
        unsigned RXB0EID3               :1;
        unsigned RXB0EID4               :1;
        unsigned RXB0EID5               :1;
        unsigned RXB0EID6               :1;
        unsigned RXB0EID7               :1;
    };
} RXB0EIDLbits_t;
extern volatile RXB0EIDLbits_t RXB0EIDLbits __at(0xF64);
// bitfield macros
#define _RXB0EIDL_EID0_POSN                                 0x0
#define _RXB0EIDL_EID0_POSITION                             0x0
#define _RXB0EIDL_EID0_SIZE                                 0x1
#define _RXB0EIDL_EID0_LENGTH                               0x1
#define _RXB0EIDL_EID0_MASK                                 0x1
#define _RXB0EIDL_EID1_POSN                                 0x1
#define _RXB0EIDL_EID1_POSITION                             0x1
#define _RXB0EIDL_EID1_SIZE                                 0x1
#define _RXB0EIDL_EID1_LENGTH                               0x1
#define _RXB0EIDL_EID1_MASK                                 0x2
#define _RXB0EIDL_EID2_POSN                                 0x2
#define _RXB0EIDL_EID2_POSITION                             0x2
#define _RXB0EIDL_EID2_SIZE                                 0x1
#define _RXB0EIDL_EID2_LENGTH                               0x1
#define _RXB0EIDL_EID2_MASK                                 0x4
#define _RXB0EIDL_EID3_POSN                                 0x3
#define _RXB0EIDL_EID3_POSITION                             0x3
#define _RXB0EIDL_EID3_SIZE                                 0x1
#define _RXB0EIDL_EID3_LENGTH                               0x1
#define _RXB0EIDL_EID3_MASK                                 0x8
#define _RXB0EIDL_EID4_POSN                                 0x4
#define _RXB0EIDL_EID4_POSITION                             0x4
#define _RXB0EIDL_EID4_SIZE                                 0x1
#define _RXB0EIDL_EID4_LENGTH                               0x1
#define _RXB0EIDL_EID4_MASK                                 0x10
#define _RXB0EIDL_EID5_POSN                                 0x5
#define _RXB0EIDL_EID5_POSITION                             0x5
#define _RXB0EIDL_EID5_SIZE                                 0x1
#define _RXB0EIDL_EID5_LENGTH                               0x1
#define _RXB0EIDL_EID5_MASK                                 0x20
#define _RXB0EIDL_EID6_POSN                                 0x6
#define _RXB0EIDL_EID6_POSITION                             0x6
#define _RXB0EIDL_EID6_SIZE                                 0x1
#define _RXB0EIDL_EID6_LENGTH                               0x1
#define _RXB0EIDL_EID6_MASK                                 0x40
#define _RXB0EIDL_EID7_POSN                                 0x7
#define _RXB0EIDL_EID7_POSITION                             0x7
#define _RXB0EIDL_EID7_SIZE                                 0x1
#define _RXB0EIDL_EID7_LENGTH                               0x1
#define _RXB0EIDL_EID7_MASK                                 0x80
#define _RXB0EIDL_RXB0EID0_POSN                             0x0
#define _RXB0EIDL_RXB0EID0_POSITION                         0x0
#define _RXB0EIDL_RXB0EID0_SIZE                             0x1
#define _RXB0EIDL_RXB0EID0_LENGTH                           0x1
#define _RXB0EIDL_RXB0EID0_MASK                             0x1
#define _RXB0EIDL_RXB0EID1_POSN                             0x1
#define _RXB0EIDL_RXB0EID1_POSITION                         0x1
#define _RXB0EIDL_RXB0EID1_SIZE                             0x1
#define _RXB0EIDL_RXB0EID1_LENGTH                           0x1
#define _RXB0EIDL_RXB0EID1_MASK                             0x2
#define _RXB0EIDL_RXB0EID2_POSN                             0x2
#define _RXB0EIDL_RXB0EID2_POSITION                         0x2
#define _RXB0EIDL_RXB0EID2_SIZE                             0x1
#define _RXB0EIDL_RXB0EID2_LENGTH                           0x1
#define _RXB0EIDL_RXB0EID2_MASK                             0x4
#define _RXB0EIDL_RXB0EID3_POSN                             0x3
#define _RXB0EIDL_RXB0EID3_POSITION                         0x3
#define _RXB0EIDL_RXB0EID3_SIZE                             0x1
#define _RXB0EIDL_RXB0EID3_LENGTH                           0x1
#define _RXB0EIDL_RXB0EID3_MASK                             0x8
#define _RXB0EIDL_RXB0EID4_POSN                             0x4
#define _RXB0EIDL_RXB0EID4_POSITION                         0x4
#define _RXB0EIDL_RXB0EID4_SIZE                             0x1
#define _RXB0EIDL_RXB0EID4_LENGTH                           0x1
#define _RXB0EIDL_RXB0EID4_MASK                             0x10
#define _RXB0EIDL_RXB0EID5_POSN                             0x5
#define _RXB0EIDL_RXB0EID5_POSITION                         0x5
#define _RXB0EIDL_RXB0EID5_SIZE                             0x1
#define _RXB0EIDL_RXB0EID5_LENGTH                           0x1
#define _RXB0EIDL_RXB0EID5_MASK                             0x20
#define _RXB0EIDL_RXB0EID6_POSN                             0x6
#define _RXB0EIDL_RXB0EID6_POSITION                         0x6
#define _RXB0EIDL_RXB0EID6_SIZE                             0x1
#define _RXB0EIDL_RXB0EID6_LENGTH                           0x1
#define _RXB0EIDL_RXB0EID6_MASK                             0x40
#define _RXB0EIDL_RXB0EID7_POSN                             0x7
#define _RXB0EIDL_RXB0EID7_POSITION                         0x7
#define _RXB0EIDL_RXB0EID7_SIZE                             0x1
#define _RXB0EIDL_RXB0EID7_LENGTH                           0x1
#define _RXB0EIDL_RXB0EID7_MASK                             0x80

// Register: RXB0DLC
#define RXB0DLC RXB0DLC
extern volatile unsigned char           RXB0DLC             __at(0xF65);
#ifndef _LIB_BUILD
asm("RXB0DLC equ 0F65h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DLC0                   :1;
        unsigned DLC1                   :1;
        unsigned DLC2                   :1;
        unsigned DLC3                   :1;
        unsigned RB0                    :1;
        unsigned RB1                    :1;
        unsigned RXRTR                  :1;
    };
    struct {
        unsigned                        :4;
        unsigned RESRB0                 :1;
        unsigned RESRB1                 :1;
    };
    struct {
        unsigned RXB0DLC0               :1;
        unsigned RXB0DLC1               :1;
        unsigned RXB0DLC2               :1;
        unsigned RXB0DLC3               :1;
        unsigned RXB0RB0                :1;
        unsigned RXB0RB1                :1;
        unsigned RXB0RTR                :1;
    };
} RXB0DLCbits_t;
extern volatile RXB0DLCbits_t RXB0DLCbits __at(0xF65);
// bitfield macros
#define _RXB0DLC_DLC0_POSN                                  0x0
#define _RXB0DLC_DLC0_POSITION                              0x0
#define _RXB0DLC_DLC0_SIZE                                  0x1
#define _RXB0DLC_DLC0_LENGTH                                0x1
#define _RXB0DLC_DLC0_MASK                                  0x1
#define _RXB0DLC_DLC1_POSN                                  0x1
#define _RXB0DLC_DLC1_POSITION                              0x1
#define _RXB0DLC_DLC1_SIZE                                  0x1
#define _RXB0DLC_DLC1_LENGTH                                0x1
#define _RXB0DLC_DLC1_MASK                                  0x2
#define _RXB0DLC_DLC2_POSN                                  0x2
#define _RXB0DLC_DLC2_POSITION                              0x2
#define _RXB0DLC_DLC2_SIZE                                  0x1
#define _RXB0DLC_DLC2_LENGTH                                0x1
#define _RXB0DLC_DLC2_MASK                                  0x4
#define _RXB0DLC_DLC3_POSN                                  0x3
#define _RXB0DLC_DLC3_POSITION                              0x3
#define _RXB0DLC_DLC3_SIZE                                  0x1
#define _RXB0DLC_DLC3_LENGTH                                0x1
#define _RXB0DLC_DLC3_MASK                                  0x8
#define _RXB0DLC_RB0_POSN                                   0x4
#define _RXB0DLC_RB0_POSITION                               0x4
#define _RXB0DLC_RB0_SIZE                                   0x1
#define _RXB0DLC_RB0_LENGTH                                 0x1
#define _RXB0DLC_RB0_MASK                                   0x10
#define _RXB0DLC_RB1_POSN                                   0x5
#define _RXB0DLC_RB1_POSITION                               0x5
#define _RXB0DLC_RB1_SIZE                                   0x1
#define _RXB0DLC_RB1_LENGTH                                 0x1
#define _RXB0DLC_RB1_MASK                                   0x20
#define _RXB0DLC_RXRTR_POSN                                 0x6
#define _RXB0DLC_RXRTR_POSITION                             0x6
#define _RXB0DLC_RXRTR_SIZE                                 0x1
#define _RXB0DLC_RXRTR_LENGTH                               0x1
#define _RXB0DLC_RXRTR_MASK                                 0x40
#define _RXB0DLC_RESRB0_POSN                                0x4
#define _RXB0DLC_RESRB0_POSITION                            0x4
#define _RXB0DLC_RESRB0_SIZE                                0x1
#define _RXB0DLC_RESRB0_LENGTH                              0x1
#define _RXB0DLC_RESRB0_MASK                                0x10
#define _RXB0DLC_RESRB1_POSN                                0x5
#define _RXB0DLC_RESRB1_POSITION                            0x5
#define _RXB0DLC_RESRB1_SIZE                                0x1
#define _RXB0DLC_RESRB1_LENGTH                              0x1
#define _RXB0DLC_RESRB1_MASK                                0x20
#define _RXB0DLC_RXB0DLC0_POSN                              0x0
#define _RXB0DLC_RXB0DLC0_POSITION                          0x0
#define _RXB0DLC_RXB0DLC0_SIZE                              0x1
#define _RXB0DLC_RXB0DLC0_LENGTH                            0x1
#define _RXB0DLC_RXB0DLC0_MASK                              0x1
#define _RXB0DLC_RXB0DLC1_POSN                              0x1
#define _RXB0DLC_RXB0DLC1_POSITION                          0x1
#define _RXB0DLC_RXB0DLC1_SIZE                              0x1
#define _RXB0DLC_RXB0DLC1_LENGTH                            0x1
#define _RXB0DLC_RXB0DLC1_MASK                              0x2
#define _RXB0DLC_RXB0DLC2_POSN                              0x2
#define _RXB0DLC_RXB0DLC2_POSITION                          0x2
#define _RXB0DLC_RXB0DLC2_SIZE                              0x1
#define _RXB0DLC_RXB0DLC2_LENGTH                            0x1
#define _RXB0DLC_RXB0DLC2_MASK                              0x4
#define _RXB0DLC_RXB0DLC3_POSN                              0x3
#define _RXB0DLC_RXB0DLC3_POSITION                          0x3
#define _RXB0DLC_RXB0DLC3_SIZE                              0x1
#define _RXB0DLC_RXB0DLC3_LENGTH                            0x1
#define _RXB0DLC_RXB0DLC3_MASK                              0x8
#define _RXB0DLC_RXB0RB0_POSN                               0x4
#define _RXB0DLC_RXB0RB0_POSITION                           0x4
#define _RXB0DLC_RXB0RB0_SIZE                               0x1
#define _RXB0DLC_RXB0RB0_LENGTH                             0x1
#define _RXB0DLC_RXB0RB0_MASK                               0x10
#define _RXB0DLC_RXB0RB1_POSN                               0x5
#define _RXB0DLC_RXB0RB1_POSITION                           0x5
#define _RXB0DLC_RXB0RB1_SIZE                               0x1
#define _RXB0DLC_RXB0RB1_LENGTH                             0x1
#define _RXB0DLC_RXB0RB1_MASK                               0x20
#define _RXB0DLC_RXB0RTR_POSN                               0x6
#define _RXB0DLC_RXB0RTR_POSITION                           0x6
#define _RXB0DLC_RXB0RTR_SIZE                               0x1
#define _RXB0DLC_RXB0RTR_LENGTH                             0x1
#define _RXB0DLC_RXB0RTR_MASK                               0x40

// Register: RXB0D0
#define RXB0D0 RXB0D0
extern volatile unsigned char           RXB0D0              __at(0xF66);
#ifndef _LIB_BUILD
asm("RXB0D0 equ 0F66h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RXB0D00                :1;
        unsigned RXB0D01                :1;
        unsigned RXB0D02                :1;
        unsigned RXB0D03                :1;
        unsigned RXB0D04                :1;
        unsigned RXB0D05                :1;
        unsigned RXB0D06                :1;
        unsigned RXB0D07                :1;
    };
} RXB0D0bits_t;
extern volatile RXB0D0bits_t RXB0D0bits __at(0xF66);
// bitfield macros
#define _RXB0D0_RXB0D00_POSN                                0x0
#define _RXB0D0_RXB0D00_POSITION                            0x0
#define _RXB0D0_RXB0D00_SIZE                                0x1
#define _RXB0D0_RXB0D00_LENGTH                              0x1
#define _RXB0D0_RXB0D00_MASK                                0x1
#define _RXB0D0_RXB0D01_POSN                                0x1
#define _RXB0D0_RXB0D01_POSITION                            0x1
#define _RXB0D0_RXB0D01_SIZE                                0x1
#define _RXB0D0_RXB0D01_LENGTH                              0x1
#define _RXB0D0_RXB0D01_MASK                                0x2
#define _RXB0D0_RXB0D02_POSN                                0x2
#define _RXB0D0_RXB0D02_POSITION                            0x2
#define _RXB0D0_RXB0D02_SIZE                                0x1
#define _RXB0D0_RXB0D02_LENGTH                              0x1
#define _RXB0D0_RXB0D02_MASK                                0x4
#define _RXB0D0_RXB0D03_POSN                                0x3
#define _RXB0D0_RXB0D03_POSITION                            0x3
#define _RXB0D0_RXB0D03_SIZE                                0x1
#define _RXB0D0_RXB0D03_LENGTH                              0x1
#define _RXB0D0_RXB0D03_MASK                                0x8
#define _RXB0D0_RXB0D04_POSN                                0x4
#define _RXB0D0_RXB0D04_POSITION                            0x4
#define _RXB0D0_RXB0D04_SIZE                                0x1
#define _RXB0D0_RXB0D04_LENGTH                              0x1
#define _RXB0D0_RXB0D04_MASK                                0x10
#define _RXB0D0_RXB0D05_POSN                                0x5
#define _RXB0D0_RXB0D05_POSITION                            0x5
#define _RXB0D0_RXB0D05_SIZE                                0x1
#define _RXB0D0_RXB0D05_LENGTH                              0x1
#define _RXB0D0_RXB0D05_MASK                                0x20
#define _RXB0D0_RXB0D06_POSN                                0x6
#define _RXB0D0_RXB0D06_POSITION                            0x6
#define _RXB0D0_RXB0D06_SIZE                                0x1
#define _RXB0D0_RXB0D06_LENGTH                              0x1
#define _RXB0D0_RXB0D06_MASK                                0x40
#define _RXB0D0_RXB0D07_POSN                                0x7
#define _RXB0D0_RXB0D07_POSITION                            0x7
#define _RXB0D0_RXB0D07_SIZE                                0x1
#define _RXB0D0_RXB0D07_LENGTH                              0x1
#define _RXB0D0_RXB0D07_MASK                                0x80

// Register: RXB0D1
#define RXB0D1 RXB0D1
extern volatile unsigned char           RXB0D1              __at(0xF67);
#ifndef _LIB_BUILD
asm("RXB0D1 equ 0F67h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RXB0D10                :1;
        unsigned RXB0D11                :1;
        unsigned RXB0D12                :1;
        unsigned RXB0D13                :1;
        unsigned RXB0D14                :1;
        unsigned RXB0D15                :1;
        unsigned RXB0D16                :1;
        unsigned RXB0D17                :1;
    };
} RXB0D1bits_t;
extern volatile RXB0D1bits_t RXB0D1bits __at(0xF67);
// bitfield macros
#define _RXB0D1_RXB0D10_POSN                                0x0
#define _RXB0D1_RXB0D10_POSITION                            0x0
#define _RXB0D1_RXB0D10_SIZE                                0x1
#define _RXB0D1_RXB0D10_LENGTH                              0x1
#define _RXB0D1_RXB0D10_MASK                                0x1
#define _RXB0D1_RXB0D11_POSN                                0x1
#define _RXB0D1_RXB0D11_POSITION                            0x1
#define _RXB0D1_RXB0D11_SIZE                                0x1
#define _RXB0D1_RXB0D11_LENGTH                              0x1
#define _RXB0D1_RXB0D11_MASK                                0x2
#define _RXB0D1_RXB0D12_POSN                                0x2
#define _RXB0D1_RXB0D12_POSITION                            0x2
#define _RXB0D1_RXB0D12_SIZE                                0x1
#define _RXB0D1_RXB0D12_LENGTH                              0x1
#define _RXB0D1_RXB0D12_MASK                                0x4
#define _RXB0D1_RXB0D13_POSN                                0x3
#define _RXB0D1_RXB0D13_POSITION                            0x3
#define _RXB0D1_RXB0D13_SIZE                                0x1
#define _RXB0D1_RXB0D13_LENGTH                              0x1
#define _RXB0D1_RXB0D13_MASK                                0x8
#define _RXB0D1_RXB0D14_POSN                                0x4
#define _RXB0D1_RXB0D14_POSITION                            0x4
#define _RXB0D1_RXB0D14_SIZE                                0x1
#define _RXB0D1_RXB0D14_LENGTH                              0x1
#define _RXB0D1_RXB0D14_MASK                                0x10
#define _RXB0D1_RXB0D15_POSN                                0x5
#define _RXB0D1_RXB0D15_POSITION                            0x5
#define _RXB0D1_RXB0D15_SIZE                                0x1
#define _RXB0D1_RXB0D15_LENGTH                              0x1
#define _RXB0D1_RXB0D15_MASK                                0x20
#define _RXB0D1_RXB0D16_POSN                                0x6
#define _RXB0D1_RXB0D16_POSITION                            0x6
#define _RXB0D1_RXB0D16_SIZE                                0x1
#define _RXB0D1_RXB0D16_LENGTH                              0x1
#define _RXB0D1_RXB0D16_MASK                                0x40
#define _RXB0D1_RXB0D17_POSN                                0x7
#define _RXB0D1_RXB0D17_POSITION                            0x7
#define _RXB0D1_RXB0D17_SIZE                                0x1
#define _RXB0D1_RXB0D17_LENGTH                              0x1
#define _RXB0D1_RXB0D17_MASK                                0x80

// Register: RXB0D2
#define RXB0D2 RXB0D2
extern volatile unsigned char           RXB0D2              __at(0xF68);
#ifndef _LIB_BUILD
asm("RXB0D2 equ 0F68h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RXB0D20                :1;
        unsigned RXB0D21                :1;
        unsigned RXB0D22                :1;
        unsigned RXB0D23                :1;
        unsigned RXB0D24                :1;
        unsigned RXB0D25                :1;
        unsigned RXB0D26                :1;
        unsigned RXB0D27                :1;
    };
} RXB0D2bits_t;
extern volatile RXB0D2bits_t RXB0D2bits __at(0xF68);
// bitfield macros
#define _RXB0D2_RXB0D20_POSN                                0x0
#define _RXB0D2_RXB0D20_POSITION                            0x0
#define _RXB0D2_RXB0D20_SIZE                                0x1
#define _RXB0D2_RXB0D20_LENGTH                              0x1
#define _RXB0D2_RXB0D20_MASK                                0x1
#define _RXB0D2_RXB0D21_POSN                                0x1
#define _RXB0D2_RXB0D21_POSITION                            0x1
#define _RXB0D2_RXB0D21_SIZE                                0x1
#define _RXB0D2_RXB0D21_LENGTH                              0x1
#define _RXB0D2_RXB0D21_MASK                                0x2
#define _RXB0D2_RXB0D22_POSN                                0x2
#define _RXB0D2_RXB0D22_POSITION                            0x2
#define _RXB0D2_RXB0D22_SIZE                                0x1
#define _RXB0D2_RXB0D22_LENGTH                              0x1
#define _RXB0D2_RXB0D22_MASK                                0x4
#define _RXB0D2_RXB0D23_POSN                                0x3
#define _RXB0D2_RXB0D23_POSITION                            0x3
#define _RXB0D2_RXB0D23_SIZE                                0x1
#define _RXB0D2_RXB0D23_LENGTH                              0x1
#define _RXB0D2_RXB0D23_MASK                                0x8
#define _RXB0D2_RXB0D24_POSN                                0x4
#define _RXB0D2_RXB0D24_POSITION                            0x4
#define _RXB0D2_RXB0D24_SIZE                                0x1
#define _RXB0D2_RXB0D24_LENGTH                              0x1
#define _RXB0D2_RXB0D24_MASK                                0x10
#define _RXB0D2_RXB0D25_POSN                                0x5
#define _RXB0D2_RXB0D25_POSITION                            0x5
#define _RXB0D2_RXB0D25_SIZE                                0x1
#define _RXB0D2_RXB0D25_LENGTH                              0x1
#define _RXB0D2_RXB0D25_MASK                                0x20
#define _RXB0D2_RXB0D26_POSN                                0x6
#define _RXB0D2_RXB0D26_POSITION                            0x6
#define _RXB0D2_RXB0D26_SIZE                                0x1
#define _RXB0D2_RXB0D26_LENGTH                              0x1
#define _RXB0D2_RXB0D26_MASK                                0x40
#define _RXB0D2_RXB0D27_POSN                                0x7
#define _RXB0D2_RXB0D27_POSITION                            0x7
#define _RXB0D2_RXB0D27_SIZE                                0x1
#define _RXB0D2_RXB0D27_LENGTH                              0x1
#define _RXB0D2_RXB0D27_MASK                                0x80

// Register: RXB0D3
#define RXB0D3 RXB0D3
extern volatile unsigned char           RXB0D3              __at(0xF69);
#ifndef _LIB_BUILD
asm("RXB0D3 equ 0F69h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RXB0D30                :1;
        unsigned RXB0D31                :1;
        unsigned RXB0D32                :1;
        unsigned RXB0D33                :1;
        unsigned RXB0D34                :1;
        unsigned RXB0D35                :1;
        unsigned RXB0D36                :1;
        unsigned RXB0D37                :1;
    };
} RXB0D3bits_t;
