MikroElektronika/core_packages/PIC/XC8/def/PIC18F6680/mcu.h
extern volatile __bit                   B5EID9              __at(0x7399);	// @ (0xE73 * 8 + 1)
#define                                 B5EID9_bit          _BIT_ACCESS(B5EIDH,1)
// B5SIDL<B5EXID>
extern volatile __bit                   B5EXID              __at(0x7393);	// @ (0xE72 * 8 + 3)
#define                                 B5EXID_bit          _BIT_ACCESS(B5SIDL,3)
// B5SIDL<B5EXIDE>
extern volatile __bit                   B5EXIDE             __at(0x7393);	// @ (0xE72 * 8 + 3)
#define                                 B5EXIDE_bit         _BIT_ACCESS(B5SIDL,3)
// B5CON<B5FILHIT0>
extern volatile __bit                   B5FILHIT0           __at(0x7380);	// @ (0xE70 * 8 + 0)
#define                                 B5FILHIT0_bit       _BIT_ACCESS(B5CON,0)
// B5CON<B5FILHIT1>
extern volatile __bit                   B5FILHIT1           __at(0x7381);	// @ (0xE70 * 8 + 1)
#define                                 B5FILHIT1_bit       _BIT_ACCESS(B5CON,1)
// B5CON<B5FILHIT2>
extern volatile __bit                   B5FILHIT2           __at(0x7382);	// @ (0xE70 * 8 + 2)
#define                                 B5FILHIT2_bit       _BIT_ACCESS(B5CON,2)
// B5CON<B5FILHIT3>
extern volatile __bit                   B5FILHIT3           __at(0x7383);	// @ (0xE70 * 8 + 3)
#define                                 B5FILHIT3_bit       _BIT_ACCESS(B5CON,3)
// B5CON<B5FILHIT4>
extern volatile __bit                   B5FILHIT4           __at(0x7384);	// @ (0xE70 * 8 + 4)
#define                                 B5FILHIT4_bit       _BIT_ACCESS(B5CON,4)
// BIE0<B5IE>
extern volatile __bit                   B5IE                __at(0x6FD7);	// @ (0xDFA * 8 + 7)
#define                                 B5IE_bit            _BIT_ACCESS(BIE0,7)
// B5DLC<B5RB0>
extern volatile __bit                   B5RB0               __at(0x73AC);	// @ (0xE75 * 8 + 4)
#define                                 B5RB0_bit           _BIT_ACCESS(B5DLC,4)
// B5DLC<B5RB1>
extern volatile __bit                   B5RB1               __at(0x73AD);	// @ (0xE75 * 8 + 5)
#define                                 B5RB1_bit           _BIT_ACCESS(B5DLC,5)
// B5CON<B5RTREN>
extern volatile __bit                   B5RTREN             __at(0x7382);	// @ (0xE70 * 8 + 2)
#define                                 B5RTREN_bit         _BIT_ACCESS(B5CON,2)
// B5CON<B5RTRRO>
extern volatile __bit                   B5RTRRO             __at(0x7385);	// @ (0xE70 * 8 + 5)
#define                                 B5RTRRO_bit         _BIT_ACCESS(B5CON,5)
// B5CON<B5RXFUL>
extern volatile __bit                   B5RXFUL             __at(0x7387);	// @ (0xE70 * 8 + 7)
#define                                 B5RXFUL_bit         _BIT_ACCESS(B5CON,7)
// B5CON<B5RXM1>
extern volatile __bit                   B5RXM1              __at(0x7386);	// @ (0xE70 * 8 + 6)
#define                                 B5RXM1_bit          _BIT_ACCESS(B5CON,6)
// B5DLC<B5RXRTR>
extern volatile __bit                   B5RXRTR             __at(0x73AE);	// @ (0xE75 * 8 + 6)
#define                                 B5RXRTR_bit         _BIT_ACCESS(B5DLC,6)
// B5SIDL<B5SID0>
extern volatile __bit                   B5SID0              __at(0x7395);	// @ (0xE72 * 8 + 5)
#define                                 B5SID0_bit          _BIT_ACCESS(B5SIDL,5)
// B5SIDL<B5SID1>
extern volatile __bit                   B5SID1              __at(0x7396);	// @ (0xE72 * 8 + 6)
#define                                 B5SID1_bit          _BIT_ACCESS(B5SIDL,6)
// B5SIDH<B5SID10>
extern volatile __bit                   B5SID10             __at(0x738F);	// @ (0xE71 * 8 + 7)
#define                                 B5SID10_bit         _BIT_ACCESS(B5SIDH,7)
// B5SIDL<B5SID2>
extern volatile __bit                   B5SID2              __at(0x7397);	// @ (0xE72 * 8 + 7)
#define                                 B5SID2_bit          _BIT_ACCESS(B5SIDL,7)
// B5SIDH<B5SID3>
extern volatile __bit                   B5SID3              __at(0x7388);	// @ (0xE71 * 8 + 0)
#define                                 B5SID3_bit          _BIT_ACCESS(B5SIDH,0)
// B5SIDH<B5SID4>
extern volatile __bit                   B5SID4              __at(0x7389);	// @ (0xE71 * 8 + 1)
#define                                 B5SID4_bit          _BIT_ACCESS(B5SIDH,1)
// B5SIDH<B5SID5>
extern volatile __bit                   B5SID5              __at(0x738A);	// @ (0xE71 * 8 + 2)
#define                                 B5SID5_bit          _BIT_ACCESS(B5SIDH,2)
// B5SIDH<B5SID6>
extern volatile __bit                   B5SID6              __at(0x738B);	// @ (0xE71 * 8 + 3)
#define                                 B5SID6_bit          _BIT_ACCESS(B5SIDH,3)
// B5SIDH<B5SID7>
extern volatile __bit                   B5SID7              __at(0x738C);	// @ (0xE71 * 8 + 4)
#define                                 B5SID7_bit          _BIT_ACCESS(B5SIDH,4)
// B5SIDH<B5SID8>
extern volatile __bit                   B5SID8              __at(0x738D);	// @ (0xE71 * 8 + 5)
#define                                 B5SID8_bit          _BIT_ACCESS(B5SIDH,5)
// B5SIDH<B5SID9>
extern volatile __bit                   B5SID9              __at(0x738E);	// @ (0xE71 * 8 + 6)
#define                                 B5SID9_bit          _BIT_ACCESS(B5SIDH,6)
// B5SIDL<B5SRR>
extern volatile __bit                   B5SRR               __at(0x7394);	// @ (0xE72 * 8 + 4)
#define                                 B5SRR_bit           _BIT_ACCESS(B5SIDL,4)
// B5CON<B5TXABT>
extern volatile __bit                   B5TXABT             __at(0x7386);	// @ (0xE70 * 8 + 6)
#define                                 B5TXABT_bit         _BIT_ACCESS(B5CON,6)
// B5CON<B5TXBIF>
extern volatile __bit                   B5TXBIF             __at(0x7387);	// @ (0xE70 * 8 + 7)
#define                                 B5TXBIF_bit         _BIT_ACCESS(B5CON,7)
// BSEL0<B5TXEN>
extern volatile __bit                   B5TXEN              __at(0x6FC7);	// @ (0xDF8 * 8 + 7)
#define                                 B5TXEN_bit          _BIT_ACCESS(BSEL0,7)
// B5CON<B5TXERR>
extern volatile __bit                   B5TXERR             __at(0x7384);	// @ (0xE70 * 8 + 4)
#define                                 B5TXERR_bit         _BIT_ACCESS(B5CON,4)
// B5CON<B5TXLARB>
extern volatile __bit                   B5TXLARB            __at(0x7385);	// @ (0xE70 * 8 + 5)
#define                                 B5TXLARB_bit        _BIT_ACCESS(B5CON,5)
// B5CON<B5TXPRI0>
extern volatile __bit                   B5TXPRI0            __at(0x7380);	// @ (0xE70 * 8 + 0)
#define                                 B5TXPRI0_bit        _BIT_ACCESS(B5CON,0)
// B5CON<B5TXPRI1>
extern volatile __bit                   B5TXPRI1            __at(0x7381);	// @ (0xE70 * 8 + 1)
#define                                 B5TXPRI1_bit        _BIT_ACCESS(B5CON,1)
// B5CON<B5TXREQ>
extern volatile __bit                   B5TXREQ             __at(0x7383);	// @ (0xE70 * 8 + 3)
#define                                 B5TXREQ_bit         _BIT_ACCESS(B5CON,3)
// PIE2<BCLIE>
extern volatile __bit                   BCLIE               __at(0x7D03);	// @ (0xFA0 * 8 + 3)
#define                                 BCLIE_bit           _BIT_ACCESS(PIE2,3)
// PIR2<BCLIF>
extern volatile __bit                   BCLIF               __at(0x7D0B);	// @ (0xFA1 * 8 + 3)
#define                                 BCLIF_bit           _BIT_ACCESS(PIR2,3)
// IPR2<BCLIP>
extern volatile __bit                   BCLIP               __at(0x7D13);	// @ (0xFA2 * 8 + 3)
#define                                 BCLIP_bit           _BIT_ACCESS(IPR2,3)
// SSPSTAT<BF>
extern volatile __bit                   BF                  __at(0x7E38);	// @ (0xFC7 * 8 + 0)
#define                                 BF_bit              _BIT_ACCESS(SSPSTAT,0)
// LVDCON<BGST>
extern volatile __bit                   BGST                __at(0x7E95);	// @ (0xFD2 * 8 + 5)
#define                                 BGST_bit            _BIT_ACCESS(LVDCON,5)
// RCON<BOR>
extern volatile __bit                   BOR                 __at(0x7E80);	// @ (0xFD0 * 8 + 0)
#define                                 BOR_bit             _BIT_ACCESS(RCON,0)
// BAUDCON<BRG16>
extern volatile __bit                   BRG16               __at(0x7BF3);	// @ (0xF7E * 8 + 3)
#define                                 BRG16_bit           _BIT_ACCESS(BAUDCON,3)
// TXSTA<BRGH>
extern volatile __bit                   BRGH                __at(0x7D62);	// @ (0xFAC * 8 + 2)
#define                                 BRGH_bit            _BIT_ACCESS(TXSTA,2)
// TXSTA<BRGH1>
extern volatile __bit                   BRGH1               __at(0x7D62);	// @ (0xFAC * 8 + 2)
#define                                 BRGH1_bit           _BIT_ACCESS(TXSTA,2)
// BRGCON1<BRP0>
extern volatile __bit                   BRP0                __at(0x7B80);	// @ (0xF70 * 8 + 0)
#define                                 BRP0_bit            _BIT_ACCESS(BRGCON1,0)
// BRGCON1<BRP1>
extern volatile __bit                   BRP1                __at(0x7B81);	// @ (0xF70 * 8 + 1)
#define                                 BRP1_bit            _BIT_ACCESS(BRGCON1,1)
// BRGCON1<BRP2>
extern volatile __bit                   BRP2                __at(0x7B82);	// @ (0xF70 * 8 + 2)
#define                                 BRP2_bit            _BIT_ACCESS(BRGCON1,2)
// BRGCON1<BRP3>
extern volatile __bit                   BRP3                __at(0x7B83);	// @ (0xF70 * 8 + 3)
#define                                 BRP3_bit            _BIT_ACCESS(BRGCON1,3)
// BRGCON1<BRP4>
extern volatile __bit                   BRP4                __at(0x7B84);	// @ (0xF70 * 8 + 4)
#define                                 BRP4_bit            _BIT_ACCESS(BRGCON1,4)
// BRGCON1<BRP5>
extern volatile __bit                   BRP5                __at(0x7B85);	// @ (0xF70 * 8 + 5)
#define                                 BRP5_bit            _BIT_ACCESS(BRGCON1,5)
// CMCON<C1INV>
extern volatile __bit                   C1INV               __at(0x7DA4);	// @ (0xFB4 * 8 + 4)
#define                                 C1INV_bit           _BIT_ACCESS(CMCON,4)
// CMCON<C1OUT>
extern volatile __bit                   C1OUT               __at(0x7DA6);	// @ (0xFB4 * 8 + 6)
#define                                 C1OUT_bit           _BIT_ACCESS(CMCON,6)
// PORTF<C1OUTF>
extern volatile __bit                   C1OUTF              __at(0x7C2A);	// @ (0xF85 * 8 + 2)
#define                                 C1OUTF_bit          _BIT_ACCESS(PORTF,2)
// CMCON<C2INV>
extern volatile __bit                   C2INV               __at(0x7DA5);	// @ (0xFB4 * 8 + 5)
#define                                 C2INV_bit           _BIT_ACCESS(CMCON,5)
// CMCON<C2OUT>
extern volatile __bit                   C2OUT               __at(0x7DA7);	// @ (0xFB4 * 8 + 7)
#define                                 C2OUT_bit           _BIT_ACCESS(CMCON,7)
// PORTF<C2OUTF>
extern volatile __bit                   C2OUTF              __at(0x7C29);	// @ (0xF85 * 8 + 1)
#define                                 C2OUTF_bit          _BIT_ACCESS(PORTF,1)
// PORTG<C3OUTG>
extern volatile __bit                   C3OUTG              __at(0x7C31);	// @ (0xF86 * 8 + 1)
#define                                 C3OUTG_bit          _BIT_ACCESS(PORTG,1)
// CIOCON<CANCAP>
extern volatile __bit                   CANCAP              __at(0x7B9C);	// @ (0xF73 * 8 + 4)
#define                                 CANCAP_bit          _BIT_ACCESS(CIOCON,4)
// PORTG<CANRX>
extern volatile __bit                   CANRX               __at(0x7C32);	// @ (0xF86 * 8 + 2)
#define                                 CANRX_bit           _BIT_ACCESS(PORTG,2)
// PORTG<CANTX1>
extern volatile __bit                   CANTX1              __at(0x7C30);	// @ (0xF86 * 8 + 0)
#define                                 CANTX1_bit          _BIT_ACCESS(PORTG,0)
// PORTG<CANTX2>
extern volatile __bit                   CANTX2              __at(0x7C31);	// @ (0xF86 * 8 + 1)
#define                                 CANTX2_bit          _BIT_ACCESS(PORTG,1)
// STATUS<CARRY>
extern volatile __bit                   CARRY               __at(0x7EC0);	// @ (0xFD8 * 8 + 0)
#define                                 CARRY_bit           _BIT_ACCESS(STATUS,0)
// PORTC<CCP1>
extern volatile __bit                   CCP1                __at(0x7C12);	// @ (0xF82 * 8 + 2)
#define                                 CCP1_bit            _BIT_ACCESS(PORTC,2)
// PORTE<CCP10>
extern volatile __bit                   CCP10               __at(0x7C22);	// @ (0xF84 * 8 + 2)
#define                                 CCP10_bit           _BIT_ACCESS(PORTE,2)
// PIE1<CCP1IE>
extern volatile __bit                   CCP1IE              __at(0x7CEA);	// @ (0xF9D * 8 + 2)
#define                                 CCP1IE_bit          _BIT_ACCESS(PIE1,2)
// PIR1<CCP1IF>
extern volatile __bit                   CCP1IF              __at(0x7CF2);	// @ (0xF9E * 8 + 2)
#define                                 CCP1IF_bit          _BIT_ACCESS(PIR1,2)
// IPR1<CCP1IP>
extern volatile __bit                   CCP1IP              __at(0x7CFA);	// @ (0xF9F * 8 + 2)
#define                                 CCP1IP_bit          _BIT_ACCESS(IPR1,2)
// CCP1CON<CCP1M0>
extern volatile __bit                   CCP1M0              __at(0x7DE8);	// @ (0xFBD * 8 + 0)
#define                                 CCP1M0_bit          _BIT_ACCESS(CCP1CON,0)
// CCP1CON<CCP1M1>
extern volatile __bit                   CCP1M1              __at(0x7DE9);	// @ (0xFBD * 8 + 1)
#define                                 CCP1M1_bit          _BIT_ACCESS(CCP1CON,1)
// CCP1CON<CCP1M2>
extern volatile __bit                   CCP1M2              __at(0x7DEA);	// @ (0xFBD * 8 + 2)
#define                                 CCP1M2_bit          _BIT_ACCESS(CCP1CON,2)
// CCP1CON<CCP1M3>
extern volatile __bit                   CCP1M3              __at(0x7DEB);	// @ (0xFBD * 8 + 3)
#define                                 CCP1M3_bit          _BIT_ACCESS(CCP1CON,3)
// PORTC<CCP2>
extern volatile __bit                   CCP2                __at(0x7C11);	// @ (0xF82 * 8 + 1)
#define                                 CCP2_bit            _BIT_ACCESS(PORTC,1)
// PORTE<CCP2E>
extern volatile __bit                   CCP2E               __at(0x7C27);	// @ (0xF84 * 8 + 7)
#define                                 CCP2E_bit           _BIT_ACCESS(PORTE,7)
// PIE2<CCP2IE>
extern volatile __bit                   CCP2IE              __at(0x7D00);	// @ (0xFA0 * 8 + 0)
#define                                 CCP2IE_bit          _BIT_ACCESS(PIE2,0)
// PIR2<CCP2IF>
extern volatile __bit                   CCP2IF              __at(0x7D08);	// @ (0xFA1 * 8 + 0)
#define                                 CCP2IF_bit          _BIT_ACCESS(PIR2,0)
// IPR2<CCP2IP>
extern volatile __bit                   CCP2IP              __at(0x7D10);	// @ (0xFA2 * 8 + 0)
#define                                 CCP2IP_bit          _BIT_ACCESS(IPR2,0)
// CCP2CON<CCP2M0>
extern volatile __bit                   CCP2M0              __at(0x7DD0);	// @ (0xFBA * 8 + 0)
#define                                 CCP2M0_bit          _BIT_ACCESS(CCP2CON,0)
// CCP2CON<CCP2M1>
extern volatile __bit                   CCP2M1              __at(0x7DD1);	// @ (0xFBA * 8 + 1)
#define                                 CCP2M1_bit          _BIT_ACCESS(CCP2CON,1)
// CCP2CON<CCP2M2>
extern volatile __bit                   CCP2M2              __at(0x7DD2);	// @ (0xFBA * 8 + 2)
#define                                 CCP2M2_bit          _BIT_ACCESS(CCP2CON,2)
// CCP2CON<CCP2M3>
extern volatile __bit                   CCP2M3              __at(0x7DD3);	// @ (0xFBA * 8 + 3)
#define                                 CCP2M3_bit          _BIT_ACCESS(CCP2CON,3)
// PORTB<CCP2_PA2>
extern volatile __bit                   CCP2_PA2            __at(0x7C0B);	// @ (0xF81 * 8 + 3)
#define                                 CCP2_PA2_bit        _BIT_ACCESS(PORTB,3)
// PORTE<CCP6E>
extern volatile __bit                   CCP6E               __at(0x7C26);	// @ (0xF84 * 8 + 6)
#define                                 CCP6E_bit           _BIT_ACCESS(PORTE,6)
// PORTE<CCP7E>
extern volatile __bit                   CCP7E               __at(0x7C25);	// @ (0xF84 * 8 + 5)
#define                                 CCP7E_bit           _BIT_ACCESS(PORTE,5)
// PORTE<CCP8E>
extern volatile __bit                   CCP8E               __at(0x7C24);	// @ (0xF84 * 8 + 4)
#define                                 CCP8E_bit           _BIT_ACCESS(PORTE,4)
// PORTE<CCP9E>
extern volatile __bit                   CCP9E               __at(0x7C23);	// @ (0xF84 * 8 + 3)
#define                                 CCP9E_bit           _BIT_ACCESS(PORTE,3)
// EECON1<CFGS>
extern volatile __bit                   CFGS                __at(0x7D36);	// @ (0xFA6 * 8 + 6)
#define                                 CFGS_bit            _BIT_ACCESS(EECON1,6)
// ADCON0<CHS0>
extern volatile __bit                   CHS0                __at(0x7E12);	// @ (0xFC2 * 8 + 2)
#define                                 CHS0_bit            _BIT_ACCESS(ADCON0,2)
// ADCON0<CHS1>
extern volatile __bit                   CHS1                __at(0x7E13);	// @ (0xFC2 * 8 + 3)
#define                                 CHS1_bit            _BIT_ACCESS(ADCON0,3)
// ADCON0<CHS2>
extern volatile __bit                   CHS2                __at(0x7E14);	// @ (0xFC2 * 8 + 4)
#define                                 CHS2_bit            _BIT_ACCESS(ADCON0,4)
// ADCON0<CHS3>
extern volatile __bit                   CHS3                __at(0x7E15);	// @ (0xFC2 * 8 + 5)
#define                                 CHS3_bit            _BIT_ACCESS(ADCON0,5)
// ADCON1<CHSN3>
extern volatile __bit                   CHSN3               __at(0x7E0B);	// @ (0xFC1 * 8 + 3)
#define                                 CHSN3_bit           _BIT_ACCESS(ADCON1,3)
// CMCON<CIS>
extern volatile __bit                   CIS                 __at(0x7DA3);	// @ (0xFB4 * 8 + 3)
#define                                 CIS_bit             _BIT_ACCESS(CMCON,3)
// PORTC<CK>
extern volatile __bit                   CK                  __at(0x7C16);	// @ (0xF82 * 8 + 6)
#define                                 CK_bit              _BIT_ACCESS(PORTC,6)
// SSPSTAT<CKE>
extern volatile __bit                   CKE                 __at(0x7E3E);	// @ (0xFC7 * 8 + 6)
#define                                 CKE_bit             _BIT_ACCESS(SSPSTAT,6)
// SSPCON1<CKP>
extern volatile __bit                   CKP                 __at(0x7E34);	// @ (0xFC6 * 8 + 4)
#define                                 CKP_bit             _BIT_ACCESS(SSPCON1,4)
// PORTA<CLKO>
extern volatile __bit                   CLKO                __at(0x7C06);	// @ (0xF80 * 8 + 6)
#define                                 CLKO_bit            _BIT_ACCESS(PORTA,6)
// CMCON<CM0>
extern volatile __bit                   CM0                 __at(0x7DA0);	// @ (0xFB4 * 8 + 0)
#define                                 CM0_bit             _BIT_ACCESS(CMCON,0)
// CMCON<CM1>
extern volatile __bit                   CM1                 __at(0x7DA1);	// @ (0xFB4 * 8 + 1)
#define                                 CM1_bit             _BIT_ACCESS(CMCON,1)
// CMCON<CM2>
extern volatile __bit                   CM2                 __at(0x7DA2);	// @ (0xFB4 * 8 + 2)
#define                                 CM2_bit             _BIT_ACCESS(CMCON,2)
// CMCON<CMEN0>
extern volatile __bit                   CMEN0               __at(0x7DA0);	// @ (0xFB4 * 8 + 0)
#define                                 CMEN0_bit           _BIT_ACCESS(CMCON,0)
// CMCON<CMEN1>
extern volatile __bit                   CMEN1               __at(0x7DA1);	// @ (0xFB4 * 8 + 1)
#define                                 CMEN1_bit           _BIT_ACCESS(CMCON,1)
// CMCON<CMEN2>
extern volatile __bit                   CMEN2               __at(0x7DA2);	// @ (0xFB4 * 8 + 2)
#define                                 CMEN2_bit           _BIT_ACCESS(CMCON,2)
// PIE2<CMIE>
extern volatile __bit                   CMIE                __at(0x7D06);	// @ (0xFA0 * 8 + 6)
#define                                 CMIE_bit            _BIT_ACCESS(PIE2,6)
// PIR2<CMIF>
extern volatile __bit                   CMIF                __at(0x7D0E);	// @ (0xFA1 * 8 + 6)
#define                                 CMIF_bit            _BIT_ACCESS(PIR2,6)
// IPR2<CMIP>
extern volatile __bit                   CMIP                __at(0x7D16);	// @ (0xFA2 * 8 + 6)
#define                                 CMIP_bit            _BIT_ACCESS(IPR2,6)
// RCSTA<CREN>
extern volatile __bit                   CREN                __at(0x7D5C);	// @ (0xFAB * 8 + 4)
#define                                 CREN_bit            _BIT_ACCESS(RCSTA,4)
// RCSTA<CREN1>
extern volatile __bit                   CREN1               __at(0x7D5C);	// @ (0xFAB * 8 + 4)
#define                                 CREN1_bit           _BIT_ACCESS(RCSTA,4)
// PORTE<CS>
extern volatile __bit                   CS                  __at(0x7C22);	// @ (0xF84 * 8 + 2)
#define                                 CS_bit              _BIT_ACCESS(PORTE,2)
// TXSTA<CSRC>
extern volatile __bit                   CSRC                __at(0x7D67);	// @ (0xFAC * 8 + 7)
#define                                 CSRC_bit            _BIT_ACCESS(TXSTA,7)
// TXSTA<CSRC1>
extern volatile __bit                   CSRC1               __at(0x7D67);	// @ (0xFAC * 8 + 7)
#define                                 CSRC1_bit           _BIT_ACCESS(TXSTA,7)
// CVRCON<CVR0>
extern volatile __bit                   CVR0                __at(0x7DA8);	// @ (0xFB5 * 8 + 0)
#define                                 CVR0_bit            _BIT_ACCESS(CVRCON,0)
// CVRCON<CVR1>
extern volatile __bit                   CVR1                __at(0x7DA9);	// @ (0xFB5 * 8 + 1)
#define                                 CVR1_bit            _BIT_ACCESS(CVRCON,1)
// CVRCON<CVR2>
extern volatile __bit                   CVR2                __at(0x7DAA);	// @ (0xFB5 * 8 + 2)
#define                                 CVR2_bit            _BIT_ACCESS(CVRCON,2)
// CVRCON<CVR3>
extern volatile __bit                   CVR3                __at(0x7DAB);	// @ (0xFB5 * 8 + 3)
#define                                 CVR3_bit            _BIT_ACCESS(CVRCON,3)
// CVRCON<CVREF>
extern volatile __bit                   CVREF               __at(0x7DAC);	// @ (0xFB5 * 8 + 4)
#define                                 CVREF_bit           _BIT_ACCESS(CVRCON,4)
// PORTF<CVREFF>
extern volatile __bit                   CVREFF              __at(0x7C2D);	// @ (0xF85 * 8 + 5)
#define                                 CVREFF_bit          _BIT_ACCESS(PORTF,5)
// CVRCON<CVREN>
extern volatile __bit                   CVREN               __at(0x7DAF);	// @ (0xFB5 * 8 + 7)
#define                                 CVREN_bit           _BIT_ACCESS(CVRCON,7)
// CVRCON<CVROE>
extern volatile __bit                   CVROE               __at(0x7DAE);	// @ (0xFB5 * 8 + 6)
#define                                 CVROE_bit           _BIT_ACCESS(CVRCON,6)
// CVRCON<CVROEN>
extern volatile __bit                   CVROEN              __at(0x7DAE);	// @ (0xFB5 * 8 + 6)
#define                                 CVROEN_bit          _BIT_ACCESS(CVRCON,6)
// CVRCON<CVRR>
extern volatile __bit                   CVRR                __at(0x7DAD);	// @ (0xFB5 * 8 + 5)
#define                                 CVRR_bit            _BIT_ACCESS(CVRCON,5)
// CVRCON<CVRSS>
extern volatile __bit                   CVRSS               __at(0x7DAC);	// @ (0xFB5 * 8 + 4)
#define                                 CVRSS_bit           _BIT_ACCESS(CVRCON,4)
// SSPSTAT<DA>
extern volatile __bit                   DA                  __at(0x7E3D);	// @ (0xFC7 * 8 + 5)
#define                                 DA_bit              _BIT_ACCESS(SSPSTAT,5)
// SSPSTAT<DATA_ADDRESS>
extern volatile __bit                   DATA_ADDRESS        __at(0x7E3D);	// @ (0xFC7 * 8 + 5)
#define                                 DATA_ADDRESS_bit    _BIT_ACCESS(SSPSTAT,5)
// STATUS<DC>
