MikroElektronika/core_packages/PIC/XC8/def/PIC18F6680/mcu.h
#define                                 RXF8SID3_bit        _BIT_ACCESS(RXF8SIDH,0)
// RXF8SIDH<RXF8SID4>
extern volatile __bit                   RXF8SID4            __at(0x6B41);	// @ (0xD68 * 8 + 1)
#define                                 RXF8SID4_bit        _BIT_ACCESS(RXF8SIDH,1)
// RXF8SIDH<RXF8SID5>
extern volatile __bit                   RXF8SID5            __at(0x6B42);	// @ (0xD68 * 8 + 2)
#define                                 RXF8SID5_bit        _BIT_ACCESS(RXF8SIDH,2)
// RXF8SIDH<RXF8SID6>
extern volatile __bit                   RXF8SID6            __at(0x6B43);	// @ (0xD68 * 8 + 3)
#define                                 RXF8SID6_bit        _BIT_ACCESS(RXF8SIDH,3)
// RXF8SIDH<RXF8SID7>
extern volatile __bit                   RXF8SID7            __at(0x6B44);	// @ (0xD68 * 8 + 4)
#define                                 RXF8SID7_bit        _BIT_ACCESS(RXF8SIDH,4)
// RXF8SIDH<RXF8SID8>
extern volatile __bit                   RXF8SID8            __at(0x6B45);	// @ (0xD68 * 8 + 5)
#define                                 RXF8SID8_bit        _BIT_ACCESS(RXF8SIDH,5)
// RXF8SIDH<RXF8SID9>
extern volatile __bit                   RXF8SID9            __at(0x6B46);	// @ (0xD68 * 8 + 6)
#define                                 RXF8SID9_bit        _BIT_ACCESS(RXF8SIDH,6)
// RXF9EIDL<RXF9EID0>
extern volatile __bit                   RXF9EID0            __at(0x6B98);	// @ (0xD73 * 8 + 0)
#define                                 RXF9EID0_bit        _BIT_ACCESS(RXF9EIDL,0)
// RXF9EIDL<RXF9EID1>
extern volatile __bit                   RXF9EID1            __at(0x6B99);	// @ (0xD73 * 8 + 1)
#define                                 RXF9EID1_bit        _BIT_ACCESS(RXF9EIDL,1)
// RXF9EIDH<RXF9EID10>
extern volatile __bit                   RXF9EID10           __at(0x6B92);	// @ (0xD72 * 8 + 2)
#define                                 RXF9EID10_bit       _BIT_ACCESS(RXF9EIDH,2)
// RXF9EIDH<RXF9EID11>
extern volatile __bit                   RXF9EID11           __at(0x6B93);	// @ (0xD72 * 8 + 3)
#define                                 RXF9EID11_bit       _BIT_ACCESS(RXF9EIDH,3)
// RXF9EIDH<RXF9EID12>
extern volatile __bit                   RXF9EID12           __at(0x6B94);	// @ (0xD72 * 8 + 4)
#define                                 RXF9EID12_bit       _BIT_ACCESS(RXF9EIDH,4)
// RXF9EIDH<RXF9EID13>
extern volatile __bit                   RXF9EID13           __at(0x6B95);	// @ (0xD72 * 8 + 5)
#define                                 RXF9EID13_bit       _BIT_ACCESS(RXF9EIDH,5)
// RXF9EIDH<RXF9EID14>
extern volatile __bit                   RXF9EID14           __at(0x6B96);	// @ (0xD72 * 8 + 6)
#define                                 RXF9EID14_bit       _BIT_ACCESS(RXF9EIDH,6)
// RXF9EIDH<RXF9EID15>
extern volatile __bit                   RXF9EID15           __at(0x6B97);	// @ (0xD72 * 8 + 7)
#define                                 RXF9EID15_bit       _BIT_ACCESS(RXF9EIDH,7)
// RXF9SIDL<RXF9EID16>
extern volatile __bit                   RXF9EID16           __at(0x6B88);	// @ (0xD71 * 8 + 0)
#define                                 RXF9EID16_bit       _BIT_ACCESS(RXF9SIDL,0)
// RXF9SIDL<RXF9EID17>
extern volatile __bit                   RXF9EID17           __at(0x6B89);	// @ (0xD71 * 8 + 1)
#define                                 RXF9EID17_bit       _BIT_ACCESS(RXF9SIDL,1)
// RXF9EIDL<RXF9EID2>
extern volatile __bit                   RXF9EID2            __at(0x6B9A);	// @ (0xD73 * 8 + 2)
#define                                 RXF9EID2_bit        _BIT_ACCESS(RXF9EIDL,2)
// RXF9EIDL<RXF9EID3>
extern volatile __bit                   RXF9EID3            __at(0x6B9B);	// @ (0xD73 * 8 + 3)
#define                                 RXF9EID3_bit        _BIT_ACCESS(RXF9EIDL,3)
// RXF9EIDL<RXF9EID4>
extern volatile __bit                   RXF9EID4            __at(0x6B9C);	// @ (0xD73 * 8 + 4)
#define                                 RXF9EID4_bit        _BIT_ACCESS(RXF9EIDL,4)
// RXF9EIDL<RXF9EID5>
extern volatile __bit                   RXF9EID5            __at(0x6B9D);	// @ (0xD73 * 8 + 5)
#define                                 RXF9EID5_bit        _BIT_ACCESS(RXF9EIDL,5)
// RXF9EIDL<RXF9EID6>
extern volatile __bit                   RXF9EID6            __at(0x6B9E);	// @ (0xD73 * 8 + 6)
#define                                 RXF9EID6_bit        _BIT_ACCESS(RXF9EIDL,6)
// RXF9EIDL<RXF9EID7>
extern volatile __bit                   RXF9EID7            __at(0x6B9F);	// @ (0xD73 * 8 + 7)
#define                                 RXF9EID7_bit        _BIT_ACCESS(RXF9EIDL,7)
// RXF9EIDH<RXF9EID8>
extern volatile __bit                   RXF9EID8            __at(0x6B90);	// @ (0xD72 * 8 + 0)
#define                                 RXF9EID8_bit        _BIT_ACCESS(RXF9EIDH,0)
// RXF9EIDH<RXF9EID9>
extern volatile __bit                   RXF9EID9            __at(0x6B91);	// @ (0xD72 * 8 + 1)
#define                                 RXF9EID9_bit        _BIT_ACCESS(RXF9EIDH,1)
// RXFCON1<RXF9EN>
extern volatile __bit                   RXF9EN              __at(0x6EA9);	// @ (0xDD5 * 8 + 1)
#define                                 RXF9EN_bit          _BIT_ACCESS(RXFCON1,1)
// RXF9SIDL<RXF9EXIDEN>
extern volatile __bit                   RXF9EXIDEN          __at(0x6B8B);	// @ (0xD71 * 8 + 3)
#define                                 RXF9EXIDEN_bit      _BIT_ACCESS(RXF9SIDL,3)
// RXF9SIDL<RXF9SID0>
extern volatile __bit                   RXF9SID0            __at(0x6B8D);	// @ (0xD71 * 8 + 5)
#define                                 RXF9SID0_bit        _BIT_ACCESS(RXF9SIDL,5)
// RXF9SIDL<RXF9SID1>
extern volatile __bit                   RXF9SID1            __at(0x6B8E);	// @ (0xD71 * 8 + 6)
#define                                 RXF9SID1_bit        _BIT_ACCESS(RXF9SIDL,6)
// RXF9SIDH<RXF9SID10>
extern volatile __bit                   RXF9SID10           __at(0x6B87);	// @ (0xD70 * 8 + 7)
#define                                 RXF9SID10_bit       _BIT_ACCESS(RXF9SIDH,7)
// RXF9SIDL<RXF9SID2>
extern volatile __bit                   RXF9SID2            __at(0x6B8F);	// @ (0xD71 * 8 + 7)
#define                                 RXF9SID2_bit        _BIT_ACCESS(RXF9SIDL,7)
// RXF9SIDH<RXF9SID3>
extern volatile __bit                   RXF9SID3            __at(0x6B80);	// @ (0xD70 * 8 + 0)
#define                                 RXF9SID3_bit        _BIT_ACCESS(RXF9SIDH,0)
// RXF9SIDH<RXF9SID4>
extern volatile __bit                   RXF9SID4            __at(0x6B81);	// @ (0xD70 * 8 + 1)
#define                                 RXF9SID4_bit        _BIT_ACCESS(RXF9SIDH,1)
// RXF9SIDH<RXF9SID5>
extern volatile __bit                   RXF9SID5            __at(0x6B82);	// @ (0xD70 * 8 + 2)
#define                                 RXF9SID5_bit        _BIT_ACCESS(RXF9SIDH,2)
// RXF9SIDH<RXF9SID6>
extern volatile __bit                   RXF9SID6            __at(0x6B83);	// @ (0xD70 * 8 + 3)
#define                                 RXF9SID6_bit        _BIT_ACCESS(RXF9SIDH,3)
// RXF9SIDH<RXF9SID7>
extern volatile __bit                   RXF9SID7            __at(0x6B84);	// @ (0xD70 * 8 + 4)
#define                                 RXF9SID7_bit        _BIT_ACCESS(RXF9SIDH,4)
// RXF9SIDH<RXF9SID8>
extern volatile __bit                   RXF9SID8            __at(0x6B85);	// @ (0xD70 * 8 + 5)
#define                                 RXF9SID8_bit        _BIT_ACCESS(RXF9SIDH,5)
// RXF9SIDH<RXF9SID9>
extern volatile __bit                   RXF9SID9            __at(0x6B86);	// @ (0xD70 * 8 + 6)
#define                                 RXF9SID9_bit        _BIT_ACCESS(RXF9SIDH,6)
// RXM0EIDL<RXM0EID0>
extern volatile __bit                   RXM0EID0            __at(0x78D8);	// @ (0xF1B * 8 + 0)
#define                                 RXM0EID0_bit        _BIT_ACCESS(RXM0EIDL,0)
// RXM0EIDL<RXM0EID1>
extern volatile __bit                   RXM0EID1            __at(0x78D9);	// @ (0xF1B * 8 + 1)
#define                                 RXM0EID1_bit        _BIT_ACCESS(RXM0EIDL,1)
// RXM0EIDH<RXM0EID10>
extern volatile __bit                   RXM0EID10           __at(0x78D2);	// @ (0xF1A * 8 + 2)
#define                                 RXM0EID10_bit       _BIT_ACCESS(RXM0EIDH,2)
// RXM0EIDH<RXM0EID11>
extern volatile __bit                   RXM0EID11           __at(0x78D3);	// @ (0xF1A * 8 + 3)
#define                                 RXM0EID11_bit       _BIT_ACCESS(RXM0EIDH,3)
// RXM0EIDH<RXM0EID12>
extern volatile __bit                   RXM0EID12           __at(0x78D4);	// @ (0xF1A * 8 + 4)
#define                                 RXM0EID12_bit       _BIT_ACCESS(RXM0EIDH,4)
// RXM0EIDH<RXM0EID13>
extern volatile __bit                   RXM0EID13           __at(0x78D5);	// @ (0xF1A * 8 + 5)
#define                                 RXM0EID13_bit       _BIT_ACCESS(RXM0EIDH,5)
// RXM0EIDH<RXM0EID14>
extern volatile __bit                   RXM0EID14           __at(0x78D6);	// @ (0xF1A * 8 + 6)
#define                                 RXM0EID14_bit       _BIT_ACCESS(RXM0EIDH,6)
// RXM0EIDH<RXM0EID15>
extern volatile __bit                   RXM0EID15           __at(0x78D7);	// @ (0xF1A * 8 + 7)
#define                                 RXM0EID15_bit       _BIT_ACCESS(RXM0EIDH,7)
// RXM0SIDL<RXM0EID16>
extern volatile __bit                   RXM0EID16           __at(0x78C8);	// @ (0xF19 * 8 + 0)
#define                                 RXM0EID16_bit       _BIT_ACCESS(RXM0SIDL,0)
// RXM0SIDL<RXM0EID17>
extern volatile __bit                   RXM0EID17           __at(0x78C9);	// @ (0xF19 * 8 + 1)
#define                                 RXM0EID17_bit       _BIT_ACCESS(RXM0SIDL,1)
// RXM0EIDL<RXM0EID2>
extern volatile __bit                   RXM0EID2            __at(0x78DA);	// @ (0xF1B * 8 + 2)
#define                                 RXM0EID2_bit        _BIT_ACCESS(RXM0EIDL,2)
// RXM0EIDL<RXM0EID3>
extern volatile __bit                   RXM0EID3            __at(0x78DB);	// @ (0xF1B * 8 + 3)
#define                                 RXM0EID3_bit        _BIT_ACCESS(RXM0EIDL,3)
// RXM0EIDL<RXM0EID4>
extern volatile __bit                   RXM0EID4            __at(0x78DC);	// @ (0xF1B * 8 + 4)
#define                                 RXM0EID4_bit        _BIT_ACCESS(RXM0EIDL,4)
// RXM0EIDL<RXM0EID5>
extern volatile __bit                   RXM0EID5            __at(0x78DD);	// @ (0xF1B * 8 + 5)
#define                                 RXM0EID5_bit        _BIT_ACCESS(RXM0EIDL,5)
// RXM0EIDL<RXM0EID6>
extern volatile __bit                   RXM0EID6            __at(0x78DE);	// @ (0xF1B * 8 + 6)
#define                                 RXM0EID6_bit        _BIT_ACCESS(RXM0EIDL,6)
// RXM0EIDL<RXM0EID7>
extern volatile __bit                   RXM0EID7            __at(0x78DF);	// @ (0xF1B * 8 + 7)
#define                                 RXM0EID7_bit        _BIT_ACCESS(RXM0EIDL,7)
// RXM0EIDH<RXM0EID8>
extern volatile __bit                   RXM0EID8            __at(0x78D0);	// @ (0xF1A * 8 + 0)
#define                                 RXM0EID8_bit        _BIT_ACCESS(RXM0EIDH,0)
// RXM0EIDH<RXM0EID9>
extern volatile __bit                   RXM0EID9            __at(0x78D1);	// @ (0xF1A * 8 + 1)
#define                                 RXM0EID9_bit        _BIT_ACCESS(RXM0EIDH,1)
// RXM0SIDL<RXM0EXIDM>
extern volatile __bit                   RXM0EXIDM           __at(0x78CB);	// @ (0xF19 * 8 + 3)
#define                                 RXM0EXIDM_bit       _BIT_ACCESS(RXM0SIDL,3)
// RXM0SIDL<RXM0SID0>
extern volatile __bit                   RXM0SID0            __at(0x78CD);	// @ (0xF19 * 8 + 5)
#define                                 RXM0SID0_bit        _BIT_ACCESS(RXM0SIDL,5)
// RXM0SIDL<RXM0SID1>
extern volatile __bit                   RXM0SID1            __at(0x78CE);	// @ (0xF19 * 8 + 6)
#define                                 RXM0SID1_bit        _BIT_ACCESS(RXM0SIDL,6)
// RXM0SIDH<RXM0SID10>
extern volatile __bit                   RXM0SID10           __at(0x78C7);	// @ (0xF18 * 8 + 7)
#define                                 RXM0SID10_bit       _BIT_ACCESS(RXM0SIDH,7)
// RXM0SIDL<RXM0SID2>
extern volatile __bit                   RXM0SID2            __at(0x78CF);	// @ (0xF19 * 8 + 7)
#define                                 RXM0SID2_bit        _BIT_ACCESS(RXM0SIDL,7)
// RXM0SIDH<RXM0SID3>
extern volatile __bit                   RXM0SID3            __at(0x78C0);	// @ (0xF18 * 8 + 0)
#define                                 RXM0SID3_bit        _BIT_ACCESS(RXM0SIDH,0)
// RXM0SIDH<RXM0SID4>
extern volatile __bit                   RXM0SID4            __at(0x78C1);	// @ (0xF18 * 8 + 1)
#define                                 RXM0SID4_bit        _BIT_ACCESS(RXM0SIDH,1)
// RXM0SIDH<RXM0SID5>
extern volatile __bit                   RXM0SID5            __at(0x78C2);	// @ (0xF18 * 8 + 2)
#define                                 RXM0SID5_bit        _BIT_ACCESS(RXM0SIDH,2)
// RXM0SIDH<RXM0SID6>
extern volatile __bit                   RXM0SID6            __at(0x78C3);	// @ (0xF18 * 8 + 3)
#define                                 RXM0SID6_bit        _BIT_ACCESS(RXM0SIDH,3)
// RXM0SIDH<RXM0SID7>
extern volatile __bit                   RXM0SID7            __at(0x78C4);	// @ (0xF18 * 8 + 4)
#define                                 RXM0SID7_bit        _BIT_ACCESS(RXM0SIDH,4)
// RXM0SIDH<RXM0SID8>
extern volatile __bit                   RXM0SID8            __at(0x78C5);	// @ (0xF18 * 8 + 5)
#define                                 RXM0SID8_bit        _BIT_ACCESS(RXM0SIDH,5)
// RXM0SIDH<RXM0SID9>
extern volatile __bit                   RXM0SID9            __at(0x78C6);	// @ (0xF18 * 8 + 6)
#define                                 RXM0SID9_bit        _BIT_ACCESS(RXM0SIDH,6)
// RXM1EIDL<RXM1EID0>
extern volatile __bit                   RXM1EID0            __at(0x78F8);	// @ (0xF1F * 8 + 0)
#define                                 RXM1EID0_bit        _BIT_ACCESS(RXM1EIDL,0)
// RXM1EIDL<RXM1EID1>
extern volatile __bit                   RXM1EID1            __at(0x78F9);	// @ (0xF1F * 8 + 1)
#define                                 RXM1EID1_bit        _BIT_ACCESS(RXM1EIDL,1)
// RXM1EIDH<RXM1EID10>
extern volatile __bit                   RXM1EID10           __at(0x78F2);	// @ (0xF1E * 8 + 2)
#define                                 RXM1EID10_bit       _BIT_ACCESS(RXM1EIDH,2)
// RXM1EIDH<RXM1EID11>
extern volatile __bit                   RXM1EID11           __at(0x78F3);	// @ (0xF1E * 8 + 3)
#define                                 RXM1EID11_bit       _BIT_ACCESS(RXM1EIDH,3)
// RXM1EIDH<RXM1EID12>
extern volatile __bit                   RXM1EID12           __at(0x78F4);	// @ (0xF1E * 8 + 4)
#define                                 RXM1EID12_bit       _BIT_ACCESS(RXM1EIDH,4)
// RXM1EIDH<RXM1EID13>
extern volatile __bit                   RXM1EID13           __at(0x78F5);	// @ (0xF1E * 8 + 5)
#define                                 RXM1EID13_bit       _BIT_ACCESS(RXM1EIDH,5)
// RXM1EIDH<RXM1EID14>
extern volatile __bit                   RXM1EID14           __at(0x78F6);	// @ (0xF1E * 8 + 6)
#define                                 RXM1EID14_bit       _BIT_ACCESS(RXM1EIDH,6)
// RXM1EIDH<RXM1EID15>
extern volatile __bit                   RXM1EID15           __at(0x78F7);	// @ (0xF1E * 8 + 7)
#define                                 RXM1EID15_bit       _BIT_ACCESS(RXM1EIDH,7)
// RXM1SIDL<RXM1EID16>
extern volatile __bit                   RXM1EID16           __at(0x78E8);	// @ (0xF1D * 8 + 0)
#define                                 RXM1EID16_bit       _BIT_ACCESS(RXM1SIDL,0)
// RXM1SIDL<RXM1EID17>
extern volatile __bit                   RXM1EID17           __at(0x78E9);	// @ (0xF1D * 8 + 1)
#define                                 RXM1EID17_bit       _BIT_ACCESS(RXM1SIDL,1)
// RXM1EIDL<RXM1EID2>
extern volatile __bit                   RXM1EID2            __at(0x78FA);	// @ (0xF1F * 8 + 2)
#define                                 RXM1EID2_bit        _BIT_ACCESS(RXM1EIDL,2)
// RXM1EIDL<RXM1EID3>
extern volatile __bit                   RXM1EID3            __at(0x78FB);	// @ (0xF1F * 8 + 3)
#define                                 RXM1EID3_bit        _BIT_ACCESS(RXM1EIDL,3)
// RXM1EIDL<RXM1EID4>
extern volatile __bit                   RXM1EID4            __at(0x78FC);	// @ (0xF1F * 8 + 4)
#define                                 RXM1EID4_bit        _BIT_ACCESS(RXM1EIDL,4)
// RXM1EIDL<RXM1EID5>
extern volatile __bit                   RXM1EID5            __at(0x78FD);	// @ (0xF1F * 8 + 5)
#define                                 RXM1EID5_bit        _BIT_ACCESS(RXM1EIDL,5)
// RXM1EIDL<RXM1EID6>
extern volatile __bit                   RXM1EID6            __at(0x78FE);	// @ (0xF1F * 8 + 6)
#define                                 RXM1EID6_bit        _BIT_ACCESS(RXM1EIDL,6)
// RXM1EIDL<RXM1EID7>
extern volatile __bit                   RXM1EID7            __at(0x78FF);	// @ (0xF1F * 8 + 7)
#define                                 RXM1EID7_bit        _BIT_ACCESS(RXM1EIDL,7)
// RXM1EIDH<RXM1EID8>
extern volatile __bit                   RXM1EID8            __at(0x78F0);	// @ (0xF1E * 8 + 0)
#define                                 RXM1EID8_bit        _BIT_ACCESS(RXM1EIDH,0)
// RXM1EIDH<RXM1EID9>
extern volatile __bit                   RXM1EID9            __at(0x78F1);	// @ (0xF1E * 8 + 1)
#define                                 RXM1EID9_bit        _BIT_ACCESS(RXM1EIDH,1)
// RXM1SIDL<RXM1EXIDEN>
extern volatile __bit                   RXM1EXIDEN          __at(0x78EB);	// @ (0xF1D * 8 + 3)
#define                                 RXM1EXIDEN_bit      _BIT_ACCESS(RXM1SIDL,3)
// RXM1SIDL<RXM1SID0>
extern volatile __bit                   RXM1SID0            __at(0x78ED);	// @ (0xF1D * 8 + 5)
#define                                 RXM1SID0_bit        _BIT_ACCESS(RXM1SIDL,5)
// RXM1SIDL<RXM1SID1>
extern volatile __bit                   RXM1SID1            __at(0x78EE);	// @ (0xF1D * 8 + 6)
#define                                 RXM1SID1_bit        _BIT_ACCESS(RXM1SIDL,6)
// RXM1SIDH<RXM1SID10>
extern volatile __bit                   RXM1SID10           __at(0x78E7);	// @ (0xF1C * 8 + 7)
#define                                 RXM1SID10_bit       _BIT_ACCESS(RXM1SIDH,7)
// RXM1SIDL<RXM1SID2>
extern volatile __bit                   RXM1SID2            __at(0x78EF);	// @ (0xF1D * 8 + 7)
#define                                 RXM1SID2_bit        _BIT_ACCESS(RXM1SIDL,7)
// RXM1SIDH<RXM1SID3>
extern volatile __bit                   RXM1SID3            __at(0x78E0);	// @ (0xF1C * 8 + 0)
#define                                 RXM1SID3_bit        _BIT_ACCESS(RXM1SIDH,0)
// RXM1SIDH<RXM1SID4>
extern volatile __bit                   RXM1SID4            __at(0x78E1);	// @ (0xF1C * 8 + 1)
#define                                 RXM1SID4_bit        _BIT_ACCESS(RXM1SIDH,1)
// RXM1SIDH<RXM1SID5>
extern volatile __bit                   RXM1SID5            __at(0x78E2);	// @ (0xF1C * 8 + 2)
#define                                 RXM1SID5_bit        _BIT_ACCESS(RXM1SIDH,2)
// RXM1SIDH<RXM1SID6>
extern volatile __bit                   RXM1SID6            __at(0x78E3);	// @ (0xF1C * 8 + 3)
#define                                 RXM1SID6_bit        _BIT_ACCESS(RXM1SIDH,3)
// RXM1SIDH<RXM1SID7>
extern volatile __bit                   RXM1SID7            __at(0x78E4);	// @ (0xF1C * 8 + 4)
#define                                 RXM1SID7_bit        _BIT_ACCESS(RXM1SIDH,4)
// RXM1SIDH<RXM1SID8>
extern volatile __bit                   RXM1SID8            __at(0x78E5);	// @ (0xF1C * 8 + 5)
#define                                 RXM1SID8_bit        _BIT_ACCESS(RXM1SIDH,5)
// RXM1SIDH<RXM1SID9>
extern volatile __bit                   RXM1SID9            __at(0x78E6);	// @ (0xF1C * 8 + 6)
#define                                 RXM1SID9_bit        _BIT_ACCESS(RXM1SIDH,6)
// RXB1CON<RXRTRR0>
extern volatile __bit                   RXRTRR0             __at(0x7A83);	// @ (0xF50 * 8 + 3)
#define                                 RXRTRR0_bit         _BIT_ACCESS(RXB1CON,3)
// B0CON<RXRTRRO_TXLARB>
extern volatile __bit                   RXRTRRO_TXLARB      __at(0x7105);	// @ (0xE20 * 8 + 5)
#define                                 RXRTRRO_TXLARB_bit  _BIT_ACCESS(B0CON,5)
// COMSTAT<RXWARN>
extern volatile __bit                   RXWARN              __at(0x7BA1);	// @ (0xF74 * 8 + 1)
#define                                 RXWARN_bit          _BIT_ACCESS(COMSTAT,1)
// SSPSTAT<R_NOT_W>
extern volatile __bit                   R_NOT_W             __at(0x7E3A);	// @ (0xFC7 * 8 + 2)
#define                                 R_NOT_W_bit         _BIT_ACCESS(SSPSTAT,2)
// SSPSTAT<R_W>
extern volatile __bit                   R_W                 __at(0x7E3A);	// @ (0xFC7 * 8 + 2)
#define                                 R_W_bit             _BIT_ACCESS(SSPSTAT,2)
// SSPSTAT<R_nW>
extern volatile __bit                   R_nW                __at(0x7E3A);	// @ (0xFC7 * 8 + 2)
#define                                 R_nW_bit            _BIT_ACCESS(SSPSTAT,2)
// BRGCON2<SAM>
extern volatile __bit                   SAM                 __at(0x7B8E);	// @ (0xF71 * 8 + 6)
#define                                 SAM_bit             _BIT_ACCESS(BRGCON2,6)
// PORTC<SCK>
extern volatile __bit                   SCK                 __at(0x7C13);	// @ (0xF82 * 8 + 3)
#define                                 SCK_bit             _BIT_ACCESS(PORTC,3)
// BAUDCON<SCKP>
extern volatile __bit                   SCKP                __at(0x7BF4);	// @ (0xF7E * 8 + 4)
#define                                 SCKP_bit            _BIT_ACCESS(BAUDCON,4)
// PORTC<SCL>
extern volatile __bit                   SCL                 __at(0x7C13);	// @ (0xF82 * 8 + 3)
#define                                 SCL_bit             _BIT_ACCESS(PORTC,3)
// OSCCON<SCS>
extern volatile __bit                   SCS                 __at(0x7E98);	// @ (0xFD3 * 8 + 0)
#define                                 SCS_bit             _BIT_ACCESS(OSCCON,0)
// OSCCON<SCS0>
extern volatile __bit                   SCS0                __at(0x7E98);	// @ (0xFD3 * 8 + 0)
#define                                 SCS0_bit            _BIT_ACCESS(OSCCON,0)
// OSCCON<SCS1>
extern volatile __bit                   SCS1                __at(0x7E99);	// @ (0xFD3 * 8 + 1)
#define                                 SCS1_bit            _BIT_ACCESS(OSCCON,1)
// PORTC<SDA>
extern volatile __bit                   SDA                 __at(0x7C14);	// @ (0xF82 * 8 + 4)
#define                                 SDA_bit             _BIT_ACCESS(PORTC,4)
// PORTC<SDI>
extern volatile __bit                   SDI                 __at(0x7C14);	// @ (0xF82 * 8 + 4)
#define                                 SDI_bit             _BIT_ACCESS(PORTC,4)
// PORTC<SDO>
extern volatile __bit                   SDO                 __at(0x7C15);	// @ (0xF82 * 8 + 5)
#define                                 SDO_bit             _BIT_ACCESS(PORTC,5)
// BRGCON2<SEG1PH0>
extern volatile __bit                   SEG1PH0             __at(0x7B8B);	// @ (0xF71 * 8 + 3)
#define                                 SEG1PH0_bit         _BIT_ACCESS(BRGCON2,3)
// BRGCON2<SEG1PH1>
extern volatile __bit                   SEG1PH1             __at(0x7B8C);	// @ (0xF71 * 8 + 4)
#define                                 SEG1PH1_bit         _BIT_ACCESS(BRGCON2,4)
// BRGCON2<SEG1PH2>
extern volatile __bit                   SEG1PH2             __at(0x7B8D);	// @ (0xF71 * 8 + 5)
#define                                 SEG1PH2_bit         _BIT_ACCESS(BRGCON2,5)
// BRGCON3<SEG2PH0>
extern volatile __bit                   SEG2PH0             __at(0x7B90);	// @ (0xF72 * 8 + 0)
#define                                 SEG2PH0_bit         _BIT_ACCESS(BRGCON3,0)
// BRGCON3<SEG2PH1>
extern volatile __bit                   SEG2PH1             __at(0x7B91);	// @ (0xF72 * 8 + 1)
#define                                 SEG2PH1_bit         _BIT_ACCESS(BRGCON3,1)
// BRGCON3<SEG2PH2>
extern volatile __bit                   SEG2PH2             __at(0x7B92);	// @ (0xF72 * 8 + 2)
#define                                 SEG2PH2_bit         _BIT_ACCESS(BRGCON3,2)
// BRGCON2<SEG2PHT>
